docs/recipes/vege-chilli-con-carne.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vege Chilli Con Carne</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="../static/common.css" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/spoon.ico" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Vege Chilli Con Carne</h1>
<p>
<a href="http://www.jamieoliver.com/recipes/vegetables-recipes/veggie-chilli/">Original link</a>
</p>

<div id="outline-container-orgc52e988" class="outline-2">
<h2 id="orgc52e988">Ingredients</h2>
<div class="outline-text-2" id="text-orgc52e988">
<ul class="org-ul">
<li>2 medium sweet potatoes (500g)</li>
<li>1 level teaspoon cayenne pepper, plus extra for sprinkling</li>
<li>1 heaped teaspoon ground cumin, plus extra for sprinkling</li>
<li>1 level teaspoon ground cinnamon, plus extra for sprinkling</li>
<li>olive oil</li>
<li>1 onion</li>
<li>1 red pepper</li>
<li>1 yellow pepper</li>
<li>2 cloves of garlic</li>
<li>1 bunch of fresh coriander</li>
<li>1 fresh red chilli</li>
<li>1 fresh green chilli</li>
<li>2 400 g tinned beans, such as kidney, chickpea, pinto, cannellini</li>
<li>2 400 g tins of quality plum tomatoes</li>
</ul>
</div>
</div>

<div id="outline-container-orgf301c30" class="outline-2">
<h2 id="orgf301c30">Instructions</h2>
<div class="outline-text-2" id="text-orgf301c30">
<ol class="org-ol">
<li>Preheat the oven to 200&deg;C.</li>
<li>Peel and chop the sweet potatoes into bite-sized chunks, then place onto a baking tray.</li>
<li>Sprinkle with a pinch each of cayenne, cumin, cinnamon, sea salt and black pepper, drizzle with oil then toss to coat. Roast for 40 minutes, or until golden and tender.</li>
<li>Peel and roughly chop the onion. Halve, deseed and roughly chop the peppers, then peel and finely chop the garlic.</li>
<li>Pick the coriander leaves, finely chopping the stalks. Deseed and finely chop the chillies.</li>
<li>Meanwhile, heat 2 tablespoons of oil in a large pan over a medium-high heat, add the onion, peppers and garlic, and cook for 5 minutes.</li>
<li>Add the coriander stalks, chilli and spices, and cook for a further 5 to 10 minutes, or until softened, stirring occasionally.</li>
<li>Drain and add the beans. Tip in the tomatoes, breaking them up with the back of a spoon, then stir well.</li>
<li>Bring to the boil, then reduce to medium-low and leave to tick away for 25 to 30 minutes, or until thickened and reduced &#x2013; keep an eye on it, and add a splashes of water to loosen, if needed.</li>
<li>Stir the roasted sweet potato through the chilli with most of the coriander leaves, then taste and adjust the seasoning, if needed.</li>
<li>Scatter over the remaining coriander. Delicious served with soured cream, guacamole and rice or tortilla chips.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
